#+title: Appaloosa ZSH


** Startup-Time
#+PROPERTY: header-args:sh :prologue "exec 2>&1" :epilogue ":"

#+begin_src sh :results output :exports both
hyperfine --warmup 15 -- '$SHELL -i -c exit'
#+end_src

#+RESULTS:
: Benchmark #1: $SHELL -i -c exit
:   Time (mean ± σ):      57.9 ms ±   1.2 ms    [User: 36.1 ms, System: 18.4 ms]
:   Range (min … max):    55.9 ms …  61.1 ms    49 runs

** Features
+ Zinit :: Quick and easy to use plugin manager
+ Powerlevel10k :: Blazing fast zsh theme that is ultra-customizable
+ FZF :: Fuzzy Finder
